Public Attributes | List of all members
API_NotifyViewEventType Struct Reference
Notifications Manager
Describes the Project Navigator item the notification is coming for, and the type of the notification. More...
#include <APIdefs_Callback.h>
 Public Attributes
 API_NotifyViewEventID  | notifID
The type of the notification.
 API_NavigatorMapID  | mapId
This Project Navigator map contains the item the nofication is coming for.
 API_Guid  | itemGuid
The own GUID of the navigator item.
Detailed Description
Describes the Project Navigator item the notification is coming for, and the type of the notification.
Remarks
This is the parameter of the APIViewEventHandlerProc callback function, identifying the navigator item and the type of notification your add-on was called for. In order to receive the notifications of inserted, deleted, changed or opened items you should install an APIViewEventHandlerProc with the ACAPI_Notification_CatchViewEvent function.